In [9]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression

In [37]:
train = pd.read_csv("train_final.csv")
test = pd.read_csv("test_final.csv")

In [38]:
train = train.drop(['Unnamed: 0'],axis=1)
train.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Purchase,Product_Category_3
0,1229,0,0,10,0,2,0,0,6.0,15200,14.0
1,889,1,4,7,1,2,1,0,8.0,19215,17.0
2,675,1,2,20,0,1,1,0,2.0,15665,5.0
3,1152,0,5,9,0,1,0,4,8.0,5378,14.0
4,1784,0,5,9,0,1,0,1,3.0,13055,4.0

In [39]:
train.shape

(550068, 11)

In [40]:
X_train = train.drop(['Purchase'], axis=1)
y_train = train['Purchase']

model = LinearRegression()
model.fit(X_train,y_train)

LinearRegression()

In [41]:
test.head()

,Unnamed: 0,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,User_ID,Product_ID_1
0,4,274,0,2,1,2,1,0,3,5.0,12.0,1000011,P00053842
1,5,1643,1,4,1,2,3,1,1,3.0,15.0,1000013,P00350442
2,6,717,1,4,1,2,3,1,0,11.0,15.0,1000013,P00155442
3,7,1734,1,4,1,2,3,1,1,4.0,9.0,1000013,P0094542
4,8,750,1,2,7,0,1,0,9,13.0,16.0,1000015,P00161842

In [42]:
test1 = test.drop(['Unnamed: 0','User_ID','Product_ID_1'],axis=1)
predicted = np.round(model.predict(test1))
predicted

array([10259., 11413., 11975., ...,  7960.,  7428.,  7976.])

In [45]:
sub = {'Purchase' : predicted,'User_ID' : test['User_ID'],'Product_ID' : test['Product_ID_1']}
sub = pd.DataFrame(sub)
sub.head()

   Purchase  User_ID Product_ID
0   10259.0  1000011  P00053842
1   11413.0  1000013  P00350442
2   11975.0  1000013  P00155442
3    9823.0  1000013   P0094542
4    7188.0  1000015  P00161842

In [46]:
sub.to_csv("sub1.csv")